ednieuw/RTCcheck/ESP32_RTCcheckV027/ESP32_RTCcheckV027.ino
//------------------------------------------------------------------------------              //
// Common
//----------------------------------------
#define   MAXTEXT 255
char      sptext[MAXTEXT];                                                                    // For common print use 
bool      LEDsAreOff        = false;                                                          // If true LEDs are off except time display
bool      NoTextInLeds      = false;                                                          // Flag to control printing of the text in function ColorLeds()
int       Previous_LDR_read = 512;                                                            // The actual reading from the LDR + 4x this value /5
uint16_t  MilliSecondValue  = 10;                                                             // The duration of a second  minus 1 ms. Used in Demo mode
uint32_t  Loopcounter       = 100;                                                            // ESP will restart if <10. so start with a larger start value
struct    EEPROMstorage {                                                                     // Data storage in EEPROM to maintain them after power loss
  byte DisplayChoice    = 0;
  byte TurnOffLEDsAtHH  = 0;
  byte TurnOnLEDsAtHH   = 0;
  byte LanguageChoice   = 0;
  byte LightReducer     = 0;
  int  LowerBrightness  = 0;
  int  UpperBrightness  = 0;
  int  NVRAMmem[24];                                                                          // LDR or other readings
  byte BLEOn            = 1;
  byte NTPOn            = 1;
  byte WIFIOn           = 1;  
  byte StatusLEDOn      = 1;
  byte MCUrestarted     = 0;                                                                  // No of times WIFI reconnected 
  byte LoopRebooted     = 0;                                                                  // No of times WIFI rebooted
  byte ByteFuture1      = 0;                                                                  // 
  byte TimeMinute       = 1;                                                                  // Display time per hour  
  byte DCF77On          = 0;                                                                  // Use DCF77
  byte UseRotary        = 0;                                                                  // Use coding for Rotary encoder ==1 or 3x1 membrane keypad ==2
  byte UseDS3231        = 0;                                                                  // Use the DS3231 time module 
  byte LEDstrip         = 0;                                                                  // 0 = SK6812 LED strip. 1 = WS2812 LED strip
  byte FiboChrono       = 0;                                                                  // true = Fibonacci, false = chrono clock display
  byte NoExUl           = 0;                                                                  // 0 = Normal, 1 = Extreme, 2 = Ultimate display of colours
  int  WIFIcredentials  = 0;                                                                  // Status of the WIFI connection. SSID&PWD set or in AP mode
  int  IntFuture2       = 0;                                                                  // For future use
  int  IntFuture3       = 0;                                                                  // For future use
  byte HetIsWasOff      = 0;                                                                  // Turn On or Off HET IS WAS   
  byte EdSoftLEDSOn     = 0;                                                                  // EdSoft text on/off   
  byte RandomDisplay    = 0;                                                                  // For future use 
  byte WIFInoConnection = 0;                                                                  //    
  byte UseBLELongString = 0;                                                                  // Send strings longer than 20 bytes per message. Possible in IOS app BLEserial Pro 
  uint32_t OwnColour    = 0;                                                                  // Self defined colour for clock display
  uint32_t DimmedLetter = 0;
  uint32_t BackGround   = 0;
  char SSID[30];                                                                              // 
  char Password[40];                                                                          // 
  char BLEbroadcastName[30];                                                                  // Name of the BLE beacon
  char Timezone[50];
  int  Checksum        = 0;
}  Mem; 
//--------------------------------------------                                                //
// Menu
//0        1         2         3         4
//1234567890123456789012345678901234567890----  
bool LastMenuformat = true;                                                                   // Small=true of full=false menu
const char *menu[] = {
 "A SSID B Password C BLE beacon name",
 "D Date (D15012021) T Time (T132145)",
 "E Timezone  (E<-02>2 or E<+01>-1)",
 "F Print time differences from NTP",
 "G Scan WIFI networks",
 "H H01 rotary H02 buttons H03/04 remote",
 "} Learn IR remote, + Fast BLE",
 "I Info menu, II long menu ",
 //"J Toggle use DS3231 RTC module",
 "K LDR /s, Time K1/min K2/hr K0/Off", 
 "N Display off between Nhhhh (N2208)",
 "P Status LED toggle On/Off", 
 "R Reset settings, @ Reset MCU",
 "--Light intensity settings (1-250)--",
 "S Slope, L Min, M Max  (S50 L5 M200)",
 "U Update system time in RTC U0-U7",
 "W WIFI X NTP& Z WPS CCC BLE",
 "RTC: ! See, & Update",
 "Ed Nieuwenhuijs Jan 2026" };
 
 char menusmall[][40] = {
 "I Menu, II long menu",
 "F Print time differences from NTP",
 "! See RTC times",
 "& Update system time all RTC times",
 "U Update system time in RTC U0-U7",
 "R Reset settings",
 "@ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();
 int32_t Tick = millis(); 
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 1002)) { delay(250); }                                 // Wait max 1.5 sec to establish serial connection
 InitStorage();                                                                               // Load settings from storage and check validity   
 StartLeds();
 PrintHeaps();                                                                                // LED RainbowCycle  
 while (!Serial && ( (millis()-Tick) < 3000) ) { LEDstartup(green); delay(499); }             // Wait max 3 sec to establish serial connection
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first
    #ifdef ARDUINO_BOARD
 Tekstprint("Compiled on: "); Tekstprintln(ARDUINO_BOARD);
    #endif
 Mem.MCUrestarted++;                                                                          // MCU Restart counter     
 if(Mem.MCUrestarted>5) { Reset();  ResetCredentials(); }                                     // If the MCU restarts during Setup() so often Reset all 
 StoreStructInFlashMemory();                                                                  // 
 Tekstprintlnf( "Using %s LED library", UsedEDSOFTLED?"EDSOFTLED":"NEOPIXEL");                                                           // 
 if(Mem.UseRotary==1) {LEDstartup(pink);  InitRotaryMod(); Tekstprintln("Rotary available"); }// Start the Rotary encoder
 if(Mem.UseRotary==2) {LEDstartup(grass); InitKeypad3x1(); Tekstprintln("Keypad available"); }// Start the Keypad 3x1 
 if(Mem.UseRotary >2) {LEDstartup(white);Start_IRreceiver();Tekstprintln("IRremote available");}// Start IR remote Mem.UseRotary = 3 or 4                                                                                     
 if(Mem.BLEOn)        {LEDstartup(blue);StartBLEService(); Tekstprintln("BLE started"); }     // Start BLE service 
 if(Mem.WIFIOn)       {LEDstartup(purple); ConnectWIFI();  Tekstprintln("WIFI started");}     // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 InitTimeSystem();     LEDstartup(yellow); Tekstprintln("Time system started");               // Initialize RTC + DS3231 sync
 Previous_LDR_read = ReadLDR();                                                               // Set the initial LDR reading 
 GetTijd(true);                                                                               // Get the time and do not print it
 SetupRTCs();                                                                                 // RTC8 function
 LEDstartup(green);                                                                           // Set the status LED to green
 SWversion();                                                                                 // Print the menu + version 
 Mem.MCUrestarted = 0;                                                                        // Startup went well; Set MCUrestart counter to 0    
 StoreStructInFlashMemory();                                                                  // 
 delay(250);
 LEDstartup(CLEARLEDSTARTUP);                                                                 // Erase the startup LEDs
 Tekstprintln("Setup finished");
 msTick = millis();                                                                           // Start the seconds loop counter
}


//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;                                                                               // a counter to check the speed of the loop
 CheckDevices();                                                                              // Check input from devices
 EverySecondCheck();                                                                          // Enter the command structure
}
void loop2()
{

