ednieuw/RTCcheck/ESP32_RTCcheckV027/ESP32_RTCcheckV027.ino
void setTimezone() { setenv("TZ", Mem.Timezone, 1);  tzset(); }
void initSNTP() 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP() 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI Check for a Pending command received from the web page 
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0) 
  {
   ReworkInputString(PendingCommand);
   PendingCommand = "";
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void WebPage(void) 
{
 int i = 0, n;
 html_info[0] = 0;
 DoNotLog = true;
 SWversion(LastMenuformat);                                                                   // Print the menu to the web page and BLE
 DoNotLog = false;                                                                            // If i or ii was entered DoNotLog is still true to prevent logging of the SWversion()
 for (n=0;n<strlen(index_html_top);n++)       HTML_page[i++] = (char) index_html_top[n];
 if( i > MAXSIZE_HTML_PAGE - 999) 
   {  
    strcat(HTML_page, "<br> Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE in Webpage.h ***<br><br><br>");
   }
 else
   {
    for (n=0;n<strlen(html_info);n++)         HTML_page[i++] = (char) html_info[n];
    for (n=0;n<strlen(index_html_footer);n++) HTML_page[i++] = (char) index_html_footer[n];
    HTML_page[i]=0;
   }
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
                                                                                              // Ringbuffer Web server endpoint for log data
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);
 
 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)                              // Send a GET request to <ESP_IP>/get?input1=<inputMessage>
   { 
    String inputMessage;    String inputParam;
    if (request->hasParam(PARAM_INPUT_1))                                                     // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
       {
        inputMessage = request->getParam(PARAM_INPUT_1)->value();
        inputParam = PARAM_INPUT_1;
       }
    else  {inputMessage = ""; inputParam = "none"; }                                          // inputMessage = "No message sent";

    bool NoInput = false;                                                                     // NoInput flashes a warning on the web page  
    if ( !inputMessage.equalsIgnoreCase("Y")                                                  // These commands take longer than 1 s to finish 
      && !inputMessage.equalsIgnoreCase("G")                                                  // Do not execute command via ReworkInputMessage
      && !inputMessage.equals("&") )                                                          // But execute in the loop() 
        { ReworkInputString(inputMessage);    PendingCommand = "";   }
   else { NoInput = true;                     PendingCommand = inputMessage;}                 // NoInput flashes a warning on the web page                                                                   // Option Y en G inteferes with WIFI. This is a common issue when using AsyncWebServer with NeoPixels/RMT - it's caused by interrupt conflicts and timing issues.
   if (inputMessage.equalsIgnoreCase("i")  || inputMessage.equalsIgnoreCase("ii") )           // The SWversion() is printed to the web page to update the settings of the web page
        DoNotLog = true;                                                                      // but this should not be logged in the Logviewer only when i or i is entered.  
    html_info[0] = 0;                                                                         // clear html_info
    SWversion();                                                                              // Print the menu to the web page and BLE
    DoNotLog = false;
    int i=0,n;
    for (n=0;n<strlen(index_html_top);n++)    HTML_page[i++] = (char) index_html_top[n];
    for (n=0;n<strlen(html_info);n++)         HTML_page[i++] = (char) html_info[n];
    if (NoInput)                                                                              // Add a flashing text
      {
      //  const char* msg =
      //   "<p id='warn' class='verdana-warningbg'>Option Y or G not possible from browser</p>"
      //   "<script>"
      //   "setTimeout(()=>{ let w=document.getElementById('warn');"
      //   "if(w){w.style.animation='none';}"
      //   "},5000);"
      //   "</script>";
      //  for (int n = 0; n < strlen(msg); n++) {   HTML_page[i++] = msg[n]; }
       NoInput=false;
      }
    for (n=0;n<strlen(index_html_footer);n++) HTML_page[i++] = (char) index_html_footer[n];
    HTML_page[i] = 0;
    request->send(200, "text/html", HTML_page );
    }   ); 

// Serve the OTA upload page
server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request)
{  request->send(200, "text/html", OTA_html);});

server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {                           // Handle the actual OTA upload
    shouldReboot = true;
    request->send(200, "text/html", 
      "<!DOCTYPE html><html><body>"
      "<h2>Update successful. Rebooting...</h2>"
      "<p>You will be redirected shortly.</p>"
      "<script>setTimeout(()=>{location.href='/'}, 7000);</script>"
      "</body></html>");
  }, 
  [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index) 
      {
       Tekstprintf("OTA Start: %s\n", filename.c_str());
       if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { Update.printError(Serial);  }
      }
    if (Update.write(data, len) != len) { Update.printError(Serial);   }
    if (final) 
      {
       if (Update.end(true)) { Tekstprintf("OTA Success: %u bytes\n", index + len);  } 
       else {Update.printError(Serial); }
      }
  });

